In [4]:
import pandas as pd

df = pd.read_csv("data.csv", header=None)
df

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [6]:
# check current directory
import os
os.getcwd()

'/Users/gamlielibn/my-ds-project/notebooks'

In [7]:
# check files in directory
os.listdir()

['yt_pandas.ipynb',
 'pandas_intro.ipynb',
 'data.csv',
 'mydata.csv',
 '.ipynb_checkpoints',
 '00_test_workflow.ipynb',
 '00_setup.ipynb',
 'yt_pandas_dFrames.ipynb']

In [8]:
# inspect the dataframe
df.head()

   0
0  1
1  2
2  3
3  4
4  5

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       6 non-null      int64
dtypes: int64(1)
memory usage: 176.0 bytes

In [11]:
df.describe()

              0
count  6.000000
mean   3.500000
std    1.870829
min    1.000000
25%    2.250000
50%    3.500000
75%    4.750000
max    6.000000

In [13]:
#rename the column to numbers
df.columns = ["numbers"]
df

   numbers
0        1
1        2
2        3
3        4
4        5
5        6

In [14]:
# this is a Series, NOT a dataframe. It's 1-D, indexed, vectorized, typed
# this is what will be manipulated with pandas

df["numbers"]

0    1
1    2
2    3
3    4
4    5
5    6
Name: numbers, dtype: int64

In [15]:
# compute mean of dataframe
df["numbers"].mean()

np.float64(3.5)

In [16]:
# compute median
df["numbers"].median()

np.float64(3.5)

In [17]:
# multiply each number by 2 (num * 2 for num in number)
df["numbers"] * 2

0     2
1     4
2     6
3     8
4    10
5    12
Name: numbers, dtype: int64

In [18]:
# create a new column 
df["double"] = df["numbers"] * 2
df

   numbers  double
0        1       2
1        2       4
2        3       6
3        4       8
4        5      10
5        6      12